dshuaib-666/25niandiansai/CODE_PCB/CODE/ti_project_5000_ok__newcar/keil/untitled.syscfg
UART4.uartClkSrc                       = "MFCLK";
UART4.$name                            = "UART_1";
UART4.targetBaudRate                   = 115200;
UART4.enableFIFO                       = true;
UART4.rxFifoThreshold                  = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART4.txFifoThreshold                  = "DL_UART_TX_FIFO_LEVEL_3_4_EMPTY";
UART4.enabledInterrupts                = ["DMA_DONE_TX","EOT_DONE"];
UART4.enabledDMATXTriggers             = "DL_UART_DMA_INTERRUPT_TX";
UART4.interruptPriority                = "0";
UART4.peripheral.$assign               = "UART1";
UART4.peripheral.rxPin.$assign         = "PB5";
UART4.peripheral.txPin.$assign         = "PA17";
UART4.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART4.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART4.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART4.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART4.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric10";
UART4.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART4.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART4.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART4.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric11";
UART4.DMA_CHANNEL_TX.$name             = "DMA_CH2";
UART4.DMA_CHANNEL_TX.addressMode       = "b2f";
UART4.DMA_CHANNEL_TX.srcLength         = "BYTE";
UART4.DMA_CHANNEL_TX.dstLength         = "BYTE";

ProjectConfig.deviceSpin = "MSPM0G3507";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
GPIO2.associatedPins[2].pin.$suggestSolution     = "PA27";
GPIO6.associatedPins[8].pin.$suggestSolution     = "PB13";
GPIO7.associatedPins[1].pin.$suggestSolution     = "PA0";
I2C1.peripheral.$suggestSolution                 = "I2C0";
UART4.DMA_CHANNEL_TX.peripheral.$suggestSolution = "DMA_CH0";
